{"modelTopology": {"training_config": {"metrics": null, "loss": "binary_crossentropy", "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"beta_1": 0.5, "epsilon": 1e-07, "decay": 0.0, "beta_2": 0.9990000128746033, "amsgrad": false, "lr": 0.00019999999494757503}}, "sample_weight_mode": null}, "model_config": {"class_name": "Model", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, 256, 256, 3], "name": "input_3"}, "name": "input_3"}, {"inbound_nodes": [[["input_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_6", "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "use_bias": true, "bias_regularizer": null, "kernel_size": [4, 4], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "padding": "same", "trainable": true}, "name": "conv2d_6"}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_5", "trainable": true}, "name": "leaky_re_lu_5"}, {"inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_7", "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "use_bias": true, "bias_regularizer": null, "kernel_size": [4, 4], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "padding": "same", "trainable": true}, "name": "conv2d_7"}, {"inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_4", "center": true, "epsilon": 0.001, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "momentum": 0.8, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_4"}, {"inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_6", "trainable": true}, "name": "leaky_re_lu_6"}, {"inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_8", "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 256, "use_bias": true, "bias_regularizer": null, "kernel_size": [4, 4], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "padding": "same", "trainable": true}, "name": "conv2d_8"}, {"inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_5", "center": true, "epsilon": 0.001, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "momentum": 0.8, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_5"}, {"inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_7", "trainable": true}, "name": "leaky_re_lu_7"}, {"inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_9", "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "use_bias": true, "bias_regularizer": null, "kernel_size": [4, 4], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "padding": "same", "trainable": true}, "name": "conv2d_9"}, {"inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_6", "center": true, "epsilon": 0.001, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "momentum": 0.8, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_6"}, {"inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_8", "trainable": true}, "name": "leaky_re_lu_8"}, {"inbound_nodes": [[["leaky_re_lu_8", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_10", "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "use_bias": true, "bias_regularizer": null, "kernel_size": [4, 4], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "padding": "same", "trainable": true}, "name": "conv2d_10"}, {"inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_7", "center": true, "epsilon": 0.001, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "momentum": 0.8, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_7"}, {"inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_9", "trainable": true}, "name": "leaky_re_lu_9"}, {"inbound_nodes": [[["leaky_re_lu_9", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_11", "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "use_bias": true, "bias_regularizer": null, "kernel_size": [4, 4], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "padding": "same", "trainable": true}, "name": "conv2d_11"}, {"inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_8", "center": true, "epsilon": 0.001, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "momentum": 0.8, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_8"}, {"inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_10", "trainable": true}, "name": "leaky_re_lu_10"}, {"inbound_nodes": [[["leaky_re_lu_10", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_12", "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "use_bias": true, "bias_regularizer": null, "kernel_size": [4, 4], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "padding": "same", "trainable": true}, "name": "conv2d_12"}, {"inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_9", "center": true, "epsilon": 0.001, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "momentum": 0.8, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_9"}, {"inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"data_format": "channels_last", "size": [2, 2], "name": "up_sampling2d_1", "trainable": true}, "name": "up_sampling2d_1"}, {"inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_13", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "use_bias": true, "bias_regularizer": null, "kernel_size": [4, 4], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "padding": "same", "trainable": true}, "name": "conv2d_13"}, {"inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_10", "center": true, "epsilon": 0.001, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "momentum": 0.8, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_10"}, {"inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_11", "trainable": true}, "name": "leaky_re_lu_11"}, {"inbound_nodes": [[["leaky_re_lu_11", 0, 0, {}], ["batch_normalization_8", 0, 0, {}]]], "class_name": "Concatenate", "config": {"axis": -1, "name": "concatenate_2", "trainable": true}, "name": "concatenate_2"}, {"inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"data_format": "channels_last", "size": [2, 2], "name": "up_sampling2d_2", "trainable": true}, "name": "up_sampling2d_2"}, {"inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_14", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "use_bias": true, "bias_regularizer": null, "kernel_size": [4, 4], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "padding": "same", "trainable": true}, "name": "conv2d_14"}, {"inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_11", "center": true, "epsilon": 0.001, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "momentum": 0.8, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_11"}, {"inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_12", "trainable": true}, "name": "leaky_re_lu_12"}, {"inbound_nodes": [[["leaky_re_lu_12", 0, 0, {}], ["batch_normalization_7", 0, 0, {}]]], "class_name": "Concatenate", "config": {"axis": -1, "name": "concatenate_3", "trainable": true}, "name": "concatenate_3"}, {"inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"data_format": "channels_last", "size": [2, 2], "name": "up_sampling2d_3", "trainable": true}, "name": "up_sampling2d_3"}, {"inbound_nodes": [[["up_sampling2d_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_15", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "use_bias": true, "bias_regularizer": null, "kernel_size": [4, 4], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "padding": "same", "trainable": true}, "name": "conv2d_15"}, {"inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_12", "center": true, "epsilon": 0.001, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "momentum": 0.8, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_12"}, {"inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_13", "trainable": true}, "name": "leaky_re_lu_13"}, {"inbound_nodes": [[["leaky_re_lu_13", 0, 0, {}], ["batch_normalization_6", 0, 0, {}]]], "class_name": "Concatenate", "config": {"axis": -1, "name": "concatenate_4", "trainable": true}, "name": "concatenate_4"}, {"inbound_nodes": [[["concatenate_4", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"data_format": "channels_last", "size": [2, 2], "name": "up_sampling2d_4", "trainable": true}, "name": "up_sampling2d_4"}, {"inbound_nodes": [[["up_sampling2d_4", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_16", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 256, "use_bias": true, "bias_regularizer": null, "kernel_size": [4, 4], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "padding": "same", "trainable": true}, "name": "conv2d_16"}, {"inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_13", "center": true, "epsilon": 0.001, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "momentum": 0.8, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_13"}, {"inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_14", "trainable": true}, "name": "leaky_re_lu_14"}, {"inbound_nodes": [[["leaky_re_lu_14", 0, 0, {}], ["batch_normalization_5", 0, 0, {}]]], "class_name": "Concatenate", "config": {"axis": -1, "name": "concatenate_5", "trainable": true}, "name": "concatenate_5"}, {"inbound_nodes": [[["concatenate_5", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"data_format": "channels_last", "size": [2, 2], "name": "up_sampling2d_5", "trainable": true}, "name": "up_sampling2d_5"}, {"inbound_nodes": [[["up_sampling2d_5", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_17", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "use_bias": true, "bias_regularizer": null, "kernel_size": [4, 4], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "padding": "same", "trainable": true}, "name": "conv2d_17"}, {"inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_14", "center": true, "epsilon": 0.001, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "momentum": 0.8, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_14"}, {"inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_15", "trainable": true}, "name": "leaky_re_lu_15"}, {"inbound_nodes": [[["leaky_re_lu_15", 0, 0, {}], ["batch_normalization_4", 0, 0, {}]]], "class_name": "Concatenate", "config": {"axis": -1, "name": "concatenate_6", "trainable": true}, "name": "concatenate_6"}, {"inbound_nodes": [[["concatenate_6", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"data_format": "channels_last", "size": [2, 2], "name": "up_sampling2d_6", "trainable": true}, "name": "up_sampling2d_6"}, {"inbound_nodes": [[["up_sampling2d_6", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_18", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "use_bias": true, "bias_regularizer": null, "kernel_size": [4, 4], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "padding": "same", "trainable": true}, "name": "conv2d_18"}, {"inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_15", "center": true, "epsilon": 0.001, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "momentum": 0.8, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_15"}, {"inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_16", "trainable": true}, "name": "leaky_re_lu_16"}, {"inbound_nodes": [[["leaky_re_lu_16", 0, 0, {}], ["conv2d_6", 0, 0, {}]]], "class_name": "Concatenate", "config": {"axis": -1, "name": "concatenate_7", "trainable": true}, "name": "concatenate_7"}, {"inbound_nodes": [[["concatenate_7", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"data_format": "channels_last", "size": [2, 2], "name": "up_sampling2d_7", "trainable": true}, "name": "up_sampling2d_7"}, {"inbound_nodes": [[["up_sampling2d_7", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_19", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 3, "use_bias": true, "bias_regularizer": null, "kernel_size": [4, 4], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_constraint": null, "activation": "tanh", "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "padding": "same", "trainable": true}, "name": "conv2d_19"}], "input_layers": [["input_3", 0, 0]], "name": "model_2", "output_layers": [["conv2d_19", 0, 0]]}}, "keras_version": "2.1.3", "backend": "tensorflow"}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"dtype": "float32", "name": "batch_normalization_10/gamma", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_10/beta", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_10/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_10/moving_variance", "shape": [512]}]}, {"paths": ["group2-shard1of1"], "weights": [{"dtype": "float32", "name": "batch_normalization_11/gamma", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_11/beta", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_11/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_11/moving_variance", "shape": [512]}]}, {"paths": ["group3-shard1of1"], "weights": [{"dtype": "float32", "name": "batch_normalization_12/gamma", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_12/beta", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_12/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_12/moving_variance", "shape": [512]}]}, {"paths": ["group4-shard1of1"], "weights": [{"dtype": "float32", "name": "batch_normalization_13/gamma", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_13/beta", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_13/moving_mean", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_13/moving_variance", "shape": [256]}]}, {"paths": ["group5-shard1of1"], "weights": [{"dtype": "float32", "name": "batch_normalization_14/gamma", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_14/beta", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_14/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_14/moving_variance", "shape": [128]}]}, {"paths": ["group6-shard1of1"], "weights": [{"dtype": "float32", "name": "batch_normalization_15/gamma", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_15/beta", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_15/moving_mean", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_15/moving_variance", "shape": [64]}]}, {"paths": ["group7-shard1of1"], "weights": [{"dtype": "float32", "name": "batch_normalization_4/gamma", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_4/beta", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_4/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_4/moving_variance", "shape": [128]}]}, {"paths": ["group8-shard1of1"], "weights": [{"dtype": "float32", "name": "batch_normalization_5/gamma", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_5/beta", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_5/moving_mean", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_5/moving_variance", "shape": [256]}]}, {"paths": ["group9-shard1of1"], "weights": [{"dtype": "float32", "name": "batch_normalization_6/gamma", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_6/beta", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_6/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_6/moving_variance", "shape": [512]}]}, {"paths": ["group10-shard1of1"], "weights": [{"dtype": "float32", "name": "batch_normalization_7/gamma", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_7/beta", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_7/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_7/moving_variance", "shape": [512]}]}, {"paths": ["group11-shard1of1"], "weights": [{"dtype": "float32", "name": "batch_normalization_8/gamma", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_8/beta", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_8/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_8/moving_variance", "shape": [512]}]}, {"paths": ["group12-shard1of1"], "weights": [{"dtype": "float32", "name": "batch_normalization_9/gamma", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_9/beta", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_9/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_9/moving_variance", "shape": [512]}]}, {"paths": ["group13-shard1of5", "group13-shard2of5", "group13-shard3of5", "group13-shard4of5", "group13-shard5of5"], "weights": [{"dtype": "float32", "name": "conv2d_10/kernel", "shape": [4, 4, 512, 512]}, {"dtype": "float32", "name": "conv2d_10/bias", "shape": [512]}]}, {"paths": ["group14-shard1of5", "group14-shard2of5", "group14-shard3of5", "group14-shard4of5", "group14-shard5of5"], "weights": [{"dtype": "float32", "name": "conv2d_11/kernel", "shape": [4, 4, 512, 512]}, {"dtype": "float32", "name": "conv2d_11/bias", "shape": [512]}]}, {"paths": ["group15-shard1of5", "group15-shard2of5", "group15-shard3of5", "group15-shard4of5", "group15-shard5of5"], "weights": [{"dtype": "float32", "name": "conv2d_12/kernel", "shape": [4, 4, 512, 512]}, {"dtype": "float32", "name": "conv2d_12/bias", "shape": [512]}]}, {"paths": ["group16-shard1of5", "group16-shard2of5", "group16-shard3of5", "group16-shard4of5", "group16-shard5of5"], "weights": [{"dtype": "float32", "name": "conv2d_13/kernel", "shape": [4, 4, 512, 512]}, {"dtype": "float32", "name": "conv2d_13/bias", "shape": [512]}]}, {"paths": ["group17-shard1of9", "group17-shard2of9", "group17-shard3of9", "group17-shard4of9", "group17-shard5of9", "group17-shard6of9", "group17-shard7of9", "group17-shard8of9", "group17-shard9of9"], "weights": [{"dtype": "float32", "name": "conv2d_14/kernel", "shape": [4, 4, 1024, 512]}, {"dtype": "float32", "name": "conv2d_14/bias", "shape": [512]}]}, {"paths": ["group18-shard1of9", "group18-shard2of9", "group18-shard3of9", "group18-shard4of9", "group18-shard5of9", "group18-shard6of9", "group18-shard7of9", "group18-shard8of9", "group18-shard9of9"], "weights": [{"dtype": "float32", "name": "conv2d_15/kernel", "shape": [4, 4, 1024, 512]}, {"dtype": "float32", "name": "conv2d_15/bias", "shape": [512]}]}, {"paths": ["group19-shard1of5", "group19-shard2of5", "group19-shard3of5", "group19-shard4of5", "group19-shard5of5"], "weights": [{"dtype": "float32", "name": "conv2d_16/kernel", "shape": [4, 4, 1024, 256]}, {"dtype": "float32", "name": "conv2d_16/bias", "shape": [256]}]}, {"paths": ["group20-shard1of2", "group20-shard2of2"], "weights": [{"dtype": "float32", "name": "conv2d_17/kernel", "shape": [4, 4, 512, 128]}, {"dtype": "float32", "name": "conv2d_17/bias", "shape": [128]}]}, {"paths": ["group21-shard1of1"], "weights": [{"dtype": "float32", "name": "conv2d_18/kernel", "shape": [4, 4, 256, 64]}, {"dtype": "float32", "name": "conv2d_18/bias", "shape": [64]}]}, {"paths": ["group22-shard1of1"], "weights": [{"dtype": "float32", "name": "conv2d_19/kernel", "shape": [4, 4, 128, 3]}, {"dtype": "float32", "name": "conv2d_19/bias", "shape": [3]}]}, {"paths": ["group23-shard1of1"], "weights": [{"dtype": "float32", "name": "conv2d_6/kernel", "shape": [4, 4, 3, 64]}, {"dtype": "float32", "name": "conv2d_6/bias", "shape": [64]}]}, {"paths": ["group24-shard1of1"], "weights": [{"dtype": "float32", "name": "conv2d_7/kernel", "shape": [4, 4, 64, 128]}, {"dtype": "float32", "name": "conv2d_7/bias", "shape": [128]}]}, {"paths": ["group25-shard1of1"], "weights": [{"dtype": "float32", "name": "conv2d_8/kernel", "shape": [4, 4, 128, 256]}, {"dtype": "float32", "name": "conv2d_8/bias", "shape": [256]}]}, {"paths": ["group26-shard1of3", "group26-shard2of3", "group26-shard3of3"], "weights": [{"dtype": "float32", "name": "conv2d_9/kernel", "shape": [4, 4, 256, 512]}, {"dtype": "float32", "name": "conv2d_9/bias", "shape": [512]}]}]}